# © Created by Shaunelle Thomas 09/11/2019
# This program asks the user five questions total at each decision
# node related to music genres. The computer prints the resulting
# music genre that matches the input
print("\t\t\t▌│█║▌║▌║ ғιve qυeѕтιonѕ ║▌║▌║█│▌\n\n")
popular_music_in_Caribbean = input("𝓓𝓸 𝔂𝓸𝓾 𝔀𝓪𝓷𝓽 𝓪 𝓹𝓸𝓹𝓾𝓵𝓪𝓻 𝓶𝓾𝓼𝓲𝓬 𝓰𝓮𝓷𝓻𝓮 𝓯𝓻𝓸𝓶 𝓽𝓱𝓮 𝓒𝓪𝓻𝓲𝓫𝓫𝓮𝓪𝓷? "
+"\n𝓘𝓷𝓹𝓾𝓽:"
+"\n'𝔂' 𝓸𝓻 '𝓨' 𝓯𝓸𝓻 𝔂𝓮𝓼"
+"\n'𝓷' 𝓸𝓻 '𝓝' 𝓯𝓸𝓻 𝓝𝓸\n---> ")
if(popular_music_in_Caribbean == 'y' or popular_music_in_Caribbean == 'Y'):
  bob_marley_influenced = input("𝓦𝓪𝓼 𝓑𝓸𝓫 𝓜𝓪𝓻𝓵𝓮𝔂 𝓪 𝓰𝓻𝓮𝓪𝓽 𝓲𝓷𝓯𝓵𝓾𝓮𝓷𝓬𝓮𝓻 𝓯𝓸𝓻 𝓽𝓱𝓲𝓼 𝓰𝓮𝓷𝓻𝓮?\n---> ")
  if(bob_marley_influenced == 'y' or bob_marley_influenced == 'Y'):
    print("Reggae")
    print("𝓘𝓽 𝔀𝓪𝓼 𝓯𝓾𝓷 𝓹𝓵𝓪𝔂𝓲𝓷𝓰 𝓕𝓲𝓿𝓮 𝓠𝓾𝓮𝓼𝓽𝓲𝓸𝓷𝓼!")
  elif(bob_marley_influenced == 'n' or bob_marley_influenced == 'N'):
    time_of_day = input("𝓦𝓱𝓪𝓽 𝓽𝓲𝓶𝓮 𝓸𝓯 𝓽𝓱𝓮 𝓭𝓪𝔂 𝓲𝓼 𝓽𝓱𝓲𝓼 𝓰𝓮𝓷𝓻𝓮 𝓶𝓸𝓼𝓽𝓵𝔂 𝓹𝓵𝓪𝔂𝓮𝓭 𝓪𝓽 𝓒𝓪𝓻𝓷𝓲𝓿𝓪𝓵?"
    +"\n𝓘𝓷𝓹𝓾𝓽:"
    +"\n'𝓶' 𝓸𝓻 '𝓜' 𝓯𝓸𝓻 𝓜𝓸𝓻𝓷𝓲𝓷𝓰 "
    +"\n'𝓪' or 𝓐' 𝓯𝓸𝓻 𝓪𝓯𝓽𝓮𝓻𝓷𝓸𝓸𝓷 "
    +"\n'𝓮' 𝓸𝓻 '𝓔' 𝓯𝓸𝓻 𝓮𝓿𝓮𝓷𝓲𝓷𝓰\n--->")
    if(time_of_day == 'm' or time_of_day == 'M'):
      print("Calypso")
      print("𝓘𝓽 𝔀𝓪𝓼 𝓯𝓾𝓷 𝓹𝓵𝓪𝔂𝓲𝓷𝓰 𝓕𝓲𝓿𝓮 𝓠𝓾𝓮𝓼𝓽𝓲𝓸𝓷𝓼!")
    elif(time_of_day == 'a' or time_of_day == 'A'):
      print("Soca")
      print("𝓘𝓽 𝔀𝓪𝓼 𝓯𝓾𝓷 𝓹𝓵𝓪𝔂𝓲𝓷𝓰 𝓕𝓲𝓿𝓮 𝓠𝓾𝓮𝓼𝓽𝓲𝓸𝓷𝓼!")
    else:
      print("Dancehall")
      print("𝓘𝓽 𝔀𝓪𝓼 𝓯𝓾𝓷 𝓹𝓵𝓪𝔂𝓲𝓷𝓰 𝓕𝓲𝓿𝓮 𝓠𝓾𝓮𝓼𝓽𝓲𝓸𝓷𝓼!")
  else:
    print("Invalid Input!")
elif(popular_music_in_Caribbean == 'n' or popular_music_in_Caribbean == 'N'): 
  genre_popular = input("𝓦𝓱𝓪𝓽 𝓻𝓮𝓰𝓲𝓸𝓷 𝓲𝓼 𝓽𝓱𝓲𝓼 𝓰𝓮𝓷𝓻𝓮 𝓹𝓸𝓹𝓾𝓵𝓪𝓻?"
  +" \n𝓘𝓷𝓹𝓾𝓽:"
  +"\n'𝓲' 𝓸𝓻 '𝓘' 𝓯𝓸𝓻 𝓘𝓷𝓭𝓲𝓪" 
  +"\n'𝓴' 𝓸𝓻 '𝓚' 𝓯𝓸𝓻 𝓚𝓸𝓻𝓮𝓪"
  +"\n'𝓪' 𝓸𝓻 '𝓐' 𝓯𝓸𝓻 𝓐𝓯𝓻𝓲𝓬𝓪"
  +"\n'𝓫' 𝓸𝓻 '𝓑' 𝓯𝓸𝓻 𝓑𝓻𝓪𝔃𝓲𝓵"
  +"\n'𝓻' 𝓸𝓻 '𝓡' 𝓯𝓸𝓻 𝓡𝓾𝓼𝓼𝓲𝓪"
  +"\n'𝓬' 𝓸𝓻 '𝓒' 𝓯𝓸𝓻 𝓒𝓱𝓲𝓷𝓪"
  +"\n'𝓾' 𝓸𝓻 '𝓤' 𝓯𝓸𝓻 𝓤𝓢𝓐 \n---> ")
  if(genre_popular == 'i' or genre_popular == 'I'):
    print("Punjabi")
    print("𝓘𝓽 𝔀𝓪𝓼 𝓯𝓾𝓷 𝓹𝓵𝓪𝔂𝓲𝓷𝓰 𝓕𝓲𝓿𝓮 𝓠𝓾𝓮𝓼𝓽𝓲𝓸𝓷𝓼!")
  elif(genre_popular == 'k' or genre_popular == 'K'):
    print("K-Pop")
    print("𝓘𝓽 𝔀𝓪𝓼 𝓯𝓾𝓷 𝓹𝓵𝓪𝔂𝓲𝓷𝓰 𝓕𝓲𝓿𝓮 𝓠𝓾𝓮𝓼𝓽𝓲𝓸𝓷𝓼!")
  elif(genre_popular == 'a' or genre_popular == 'A'):
    print("AfroBeats")
    print("𝓘𝓽 𝔀𝓪𝓼 𝓯𝓾𝓷 𝓹𝓵𝓪𝔂𝓲𝓷𝓰 𝓕𝓲𝓿𝓮 𝓠𝓾𝓮𝓼𝓽𝓲𝓸𝓷𝓼!")
  elif(genre_popular == 'b' or genre_popular == 'B'):
    print("Samba")
    print("𝓘𝓽 𝔀𝓪𝓼 𝓯𝓾𝓷 𝓹𝓵𝓪𝔂𝓲𝓷𝓰 𝓕𝓲𝓿𝓮 𝓠𝓾𝓮𝓼𝓽𝓲𝓸𝓷𝓼!")
  elif(genre_popular == 'r' or genre_popular == 'R'):
    print("Russian Pop")
    print("𝓘𝓽 𝔀𝓪𝓼 𝓯𝓾𝓷 𝓹𝓵𝓪𝔂𝓲𝓷𝓰 𝓕𝓲𝓿𝓮 𝓠𝓾𝓮𝓼𝓽𝓲𝓸𝓷𝓼!")
  elif(genre_popular == 'c' or genre_popular == 'C'):
    print("C-pop")
    print("𝓘𝓽 𝔀𝓪𝓼 𝓯𝓾𝓷 𝓹𝓵𝓪𝔂𝓲𝓷𝓰 𝓕𝓲𝓿𝓮 𝓠𝓾𝓮𝓼𝓽𝓲𝓸𝓷𝓼!")
  elif(genre_popular == 'u' or genre_popular == 'U'):
     genre_popular_in_east_coast = input("𝓘𝓼 𝓽𝓱𝓲𝓼 𝓰𝓮𝓷𝓻𝓮 𝓹𝓸𝓹𝓾𝓵𝓪𝓻 𝓲𝓷 𝓽𝓱𝓮 𝓔𝓪𝓼𝓽 𝓒𝓸𝓪𝓼𝓽?"
     +"\n𝓘𝓷𝓹𝓾𝓽:"
     +"\n'𝔂' 𝓸𝓻 '𝓨' 𝓯𝓸𝓻 𝔂𝓮𝓼" 
     +"\n'𝓷' 𝓸𝓻 '𝓝' 𝓯𝓸𝓻 𝓝𝓸 \n---> ")
     if(genre_popular_in_east_coast == 'y' or genre_popular_in_east_coast == 'Y' ):
       print("Hip Hop")
       print("𝓘𝓽 𝔀𝓪𝓼 𝓯𝓾𝓷 𝓹𝓵𝓪𝔂𝓲𝓷𝓰 𝓕𝓲𝓿𝓮 𝓠𝓾𝓮𝓼𝓽𝓲𝓸𝓷𝓼!")
     else:
         print("Country")
         print("𝓘𝓽 𝔀𝓪𝓼 𝓯𝓾𝓷 𝓹𝓵𝓪𝔂𝓲𝓷𝓰 𝓕𝓲𝓿𝓮 𝓠𝓾𝓮𝓼𝓽𝓲𝓸𝓷𝓼!")
  else:
      print("Invalid Input! Please restart the game")
else:
  print("Invalid Input! Please restart the game")
